export interface Province {
  name: string;
  cities: string[];
}

const iranProvinces: Province[] = [
  { name: 'تهران', cities: ['تهران', 'ری', 'اسلام‌شهر', 'قدس', 'شهریار'] },
  { name: 'البرز', cities: ['کرج', 'فردیس', 'نظرآباد', 'اشتهارد'] },
  { name: 'اصفهان', cities: ['اصفهان', 'نجف‌آباد', 'کاشان', 'خمینی‌شهر'] },
  { name: 'فارس', cities: ['شیراز', 'مرودشت', 'کازرون', 'جهرم'] },
  { name: 'خراسان رضوی', cities: ['مشهد', 'نیشابور', 'سبزوار', 'تربت حیدریه'] },
  { name: 'آذربایجان شرقی', cities: ['تبریز', 'مرند', 'مراغه', 'اهر'] },
  { name: 'گیلان', cities: ['رشت', 'انزلی', 'لاهیجان', 'لنگرود'] },
  { name: 'مازندران', cities: ['ساری', 'بابل', 'آمل', 'قائم‌شهر'] },
];

export default iranProvinces;
